res_par_3/parcial3.md
```mermaid
classDiagram

class Pedido {
    items: list[str]
    cantidades: list[int]
    precios: list[float]
    estado: str
    total: int

    agregar_item()
    precio_total()
}

class ProcesadorDePagos {
  <<Interface>>
  -pagar(pedido)
}

class ProcesadorDePagosConDebito {
    codigo_seg: str
    autorizador: Autorizador
    pagar(pedido)
    autorizar_SMS(codigo_seg)
}

class ProcesadorDePagosConCredito {
    codigo_seg: str
    pagar(pedido)
}

class ProcesadorDePagosConBitcoin {
    num_bv: str
    autorizador: Autorizador

    pagar(pedido,crypto)
}

ProcesadorDePagos ..> Pedido
ProcesadorDePagosConBitcoin ..|> ProcesadorDePagos
ProcesadorDePagosConDebito ..|> ProcesadorDePagos
ProcesadorDePagosConCredito ..|> ProcesadorDePagos
```
